{
  "mushroom_id": "boledu",
  "scientific_name": "Boletus edulis",
  "common_name": "Boletus edulis",
  "edibility": "E",
  "description": "The King Bolete or Porcini features a brown to reddish-brown cap (5-30 cm) with smooth, dry surface. Pores are white when young, aging to yellowish-green, and do not bruise when handled. The thick, bulbous white to tan stem displays fine white reticulation (net-like pattern) near the apex. White flesh remains unchanging when cut, with mild nutty flavor. Spore print is olive-brown.",
  "habitat": "Mycorrhizal with spruce, pine, hemlock, and occasionally oak trees in mixed conifer and hardwood forests. Prefers well-drained soils in mature forests. Found along forest edges, trails, and under dense canopy.",
  "season": "Late summer through fall (August-November) with occasional spring flushes (May-June) in some regions. Peak fruiting after heavy rains during warm weather.",
  "regions": [
    "Pacific Northwest",
    "Rocky Mountains",
    "Northeastern forests",
    "Great Lakes region",
    "Northern California",
    "Alaska",
    "British Columbia"
  ],
  "lookalikes": [
    "Tylopilus felleus (Bitter Bolete) - has pinkish pores and intensely bitter taste",
    "Boletus variipes - pores bruise blue, similar appearance",
    "Boletus subcaerulescens - bluing reaction distinguishes it",
    "Other Boletus species - all edible but vary in quality"
  ],
  "safety_notes": "CHOICE EDIBLE: King Bolete is one of the world's most prized edible mushrooms, renowned for its excellent flavor and meaty texture. Safe to eat raw in small amounts but best when cooked. Check that pores remain white to yellow (not pink) and do not bruise blue to avoid confusion with other species. Always cook thoroughly for best digestibility.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1725981.jpg",
      "photographer": "FunGuy Nate",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-23",
      "file_size_bytes": 136488,
      "width": 640,
      "height": 536,
      "sha256": "872e36198978de9c7bf4b55be54887355acd5b1877e6bd1e0b3ac7a4cb2de5c3"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1718535.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-16",
      "file_size_bytes": 58480,
      "width": 640,
      "height": 427,
      "sha256": "da49ce350cf2577f05575095f339a6110739a88dd13234333f288fbf8f499058"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}