{
  "mushroom_id": "armost",
  "scientific_name": "Armillaria ostoyae",
  "common_name": "Dark Honey Mushroom",
  "edibility": "E",
  "description": "Dark Honey Mushroom has a dark brown to blackish-brown cap (3-12 cm) densely covered with DARK BROWN TO BLACK SCALES, especially at center - darker than other Armillaria species. Gills are white to cream, attached, developing brown stains. The stem has a PERSISTENT RING that may have cottony, yellowish patches on underside. Stem is whitish above ring, brownish below with dark fibers or scales. Grows in DENSE CLUSTERS on conifers. Flesh is white, firm. Spore print is white. Black rhizomorphs present. Famous for being the largest organism on Earth - a single clone in Oregon covers 2,400 acres.",
  "habitat": "Parasitic and saprobic on CONIFERS, especially pine, fir, spruce, and hemlock. Grows in large clusters at the base of living or dead conifer trees and stumps. Highly destructive tree pathogen causing root rot. Less common on hardwoods. Widespread in coniferous forests.",
  "season": "Fall (September-November), fruiting after fall rains. Later than many mushrooms.",
  "regions": [
    "Pacific Northwest",
    "Rocky Mountains",
    "Northeast",
    "Upper Midwest",
    "Canada",
    "Northern Europe"
  ],
  "lookalikes": [
    "Armillaria mellea - similar but less dark, broader host range",
    "Other Armillaria species - all require cooking",
    "Pholiota species - brown spores",
    "Galerina species - DEADLY - smaller, brown spores, different habitat"
  ],
  "safety_notes": "EDIBLE WITH CAUTION: Honey mushrooms (Armillaria species) are POISONOUS when raw and must be thoroughly cooked before consumption. Cook for at least 10-15 minutes at high heat. Even when properly cooked, some individuals experience allergic reactions or digestive upset. Try a small amount first to test your tolerance. Parboiling before cooking can help reduce gastrointestinal irritants and bitter taste. Do not consume with alcohol - honey mushrooms can cause adverse reactions when combined with alcohol (similar to Coprinopsis). Collect only young, firm specimens.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1713954.jpg",
      "photographer": "Nathan Wilson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-13",
      "file_size_bytes": 45026,
      "width": 480,
      "height": 640,
      "sha256": "11812fb3ce1687a77c36fefaeedb2c9efb22bca30d40c144f2c716e676ee0b08"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:30:00.000000"
}