{
  "mushroom_id": "tremes",
  "scientific_name": "Tremella mesenterica",
  "common_name": "Witches' Butter",
  "edibility": "E",
  "description": "Witches Butter is a bright golden-yellow to orange jelly fungus forming irregular brain-like or folded masses 2-8 cm across. The fruitbody is gelatinous, translucent, with a convoluted surface resembling a brain or folded intestines. Color is bright golden-orange to yellow when fresh and moist, becoming darker orange and shriveled when dry. Texture is soft, trembling, and jelly-like. Revives and swells when rehydrated. No distinct stem or cap structure.",
  "habitat": "Found on dead branches and twigs of hardwood trees, particularly oak, beech, and other deciduous species. Grows as a parasite on crust fungi (particularly Peniophora species) that colonize dead wood. Fruits on fallen branches, standing deadwood, and bark. Common in forests, woodlands, and parks. Prefers moist conditions.",
  "season": "Year-round in areas with mild wet weather, but most abundant in fall through spring (October-April). In temperate regions, primarily winter and early spring (November-March). Can fruit during summer after heavy rains. Peak during cool wet periods.",
  "regions": [
    "Europe (widespread)",
    "Eastern North America (common)",
    "Pacific Northwest (common)",
    "California (occasional)",
    "Worldwide in temperate regions",
    "Particularly common in Britain"
  ],
  "lookalikes": [
    "Tremella aurantia (edible) - similar but bright orange, parasitic on Stereum",
    "Dacrymyces species (edible) - smaller, more orange, on conifer wood",
    "Calocera viscosa (edible) - coral-like branches not brain-like",
    "No toxic lookalikes among jelly fungi"
  ],
  "safety_notes": "EDIBLE but bland: Considered edible and consumed in some cultures, but has little to no flavor. The gelatinous texture is the main characteristic. Used in traditional Chinese medicine. Safe to taste raw but typically cooked in soups or sweet dishes. No nutritional value but harmless. More interesting as an ornament than food. The bright golden-yellow color and brain-like appearance are diagnostic. No dangerous lookalikes - all similar jelly fungi are edible. Often used decoratively due to vivid color.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1731381.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-12-17",
      "file_size_bytes": 32694,
      "width": 640,
      "height": 427,
      "sha256": "23f4f40b6067140f44e12ff967c1f22b92604b2d0a4e605c5a11482334462a0a"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1731382.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-12-17",
      "file_size_bytes": 24616,
      "width": 640,
      "height": 427,
      "sha256": "bb94d948d2b36a65b8905a39e8c0caf8562ea265cfd8f11cc609375abe7260bf"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}