{
  "mushroom_id": "agasub",
  "scientific_name": "Agaricus subrutilescens",
  "common_name": "Wine-colored Agaricus",
  "edibility": "E",
  "description": "The Wine-colored Agaricus is a medium to large species with a cap 8-20 cm across, initially rounded becoming broadly convex to flat. The cap is white to cream with brown to reddish-brown fibrillose scales, often developing wine-red to pinkish-red stains with age or handling. The gills are free, initially pale pink becoming dark chocolate brown. The stem is 6-15 cm tall, white above the ring, staining wine-red to pinkish especially at the base (diagnostic feature). The ring is large and pendant. The flesh is white, slowly staining pinkish to wine-red when cut, with a pleasant almond-anise odor.",
  "habitat": "Found in coniferous and mixed forests, particularly under pine, fir, and spruce. Also in urban areas with conifers, landscaped areas with wood chips and bark mulch. Grows terrestrially in humus-rich soil and decomposing woody debris. Fruits scattered to gregarious, often in troops in wood chip beds.",
  "season": "Fall through winter (October-February) in California and Mediterranean climates. Late summer through fall (August-November) in temperate regions. Peak fruiting occurs in late fall and early winter. More cold-tolerant than many Agaricus species.",
  "regions": [
    "California (very common)",
    "Pacific Northwest (common)",
    "Southwestern United States",
    "Western North America (widespread)",
    "Mediterranean climates",
    "Coniferous forest regions"
  ],
  "lookalikes": [
    "Agaricus augustus (edible) - larger, more golden scales, less wine-red staining",
    "Agaricus crocodilinus (edible) - similar but lacks distinctive wine-red stem base staining",
    "Agaricus moelleri (toxic) - yellows intensely, phenolic odor instead of anise",
    "Large Amanita species (some deadly) - have volva at base which Agaricus lacks"
  ],
  "safety_notes": "EDIBLE: Considered edible with good flavor and firm texture when cooked. Popular with foragers in California. Cook thoroughly. Critical identification: verify pleasant ALMOND-ANISE odor (not phenolic), WINE-RED to pinkish staining especially on stem base (diagnostic feature), FREE gills turning pink then chocolate brown, CHOCOLATE BROWN spore print, NO volva at base. Avoid specimens with intense yellow bruising or unpleasant phenolic odor. The wine-red staining on the stem base is the most distinctive feature. Excellent in soups and sautés.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1716382.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-17",
      "file_size_bytes": 80414,
      "width": 640,
      "height": 480,
      "sha256": "2282913404fba100a85b46b81b99da6902789dc53d82cfe38e734143809ca12b"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1716373.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-15",
      "file_size_bytes": 92004,
      "width": 640,
      "height": 480,
      "sha256": "d36a5a5cc111729564d1e8943cf126c3e8233ccf4dcede126b2a13cd99d81814"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:18:57.615608"
}