{
  "mushroom_id": "hypchr",
  "scientific_name": "Hypomyces chrysospermus",
  "common_name": "Hypomyces chrysospermus",
  "edibility": "E",
  "description": "Golden Hypomyces is a parasitic fungus forming bright golden-yellow to orange-yellow powdery or velvety coatings on bolete mushrooms. The parasite covers the host pores and cap surface with bright yellow-gold powder (spores). Early infection shows yellow patches spreading to cover the entire mushroom. The host mushroom shape is recognizable but distorted. The yellow coating is initially velvety, becoming powdery. The host pores become completely obscured by yellow powder. Not a fleshy fruitbody like H. lactifluorum, but a surface coating.",
  "habitat": "Found in forests where boletes occur, parasitizing various bolete species particularly in the genera Leccinum, Boletus, and Suillus. The fungus colonizes existing bolete fruitbodies. Appears on fresh boletes in various stages of growth. Distribution follows host distribution in coniferous and mixed forests.",
  "season": "Summer through fall (June-November) when host boletes are fruiting. Most common in mid to late summer (July-September). Timing is tied to host availability. Can appear on boletes at any stage of development.",
  "regions": [
    "Europe (widespread)",
    "Eastern North America (uncommon)",
    "Pacific Northwest (occasional)",
    "Wherever suitable bolete hosts occur",
    "Temperate forests with boletes"
  ],
  "lookalikes": [
    "Boletes with yellow pore surface - but natural pores, not powdery coating",
    "Russula/Lactarius with H. chrysospermus - different parasite on different hosts",
    "Yellow molds on mushrooms - but less uniformly colored, different texture",
    "Uninfected yellow boletes - pores are natural, not powdery"
  ],
  "safety_notes": "NOT RECOMMENDED: While not known to be toxic, this fungus has no culinary value and the host bolete may be in various stages of decay. The infected boletes are typically degraded and unappetizing. Some sources suggest possible edibility but there is no tradition of consumption and no reason to eat it. The bright yellow powder is conspicuous but the underlying bolete may be toxic species. Avoid consuming. More interesting from a mycological perspective. The golden-yellow powdery coating on boletes is diagnostic but not useful for eating.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1734294.jpg",
      "photographer": "Liz Popich",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2025-01-05",
      "file_size_bytes": 39908,
      "width": 640,
      "height": 480,
      "sha256": "7d2a43beb0f25fae1f93fa65a65aeac3aaa96ef17a4b27b67204441e40222ad7"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1734295.jpg",
      "photographer": "Liz Popich",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2025-01-05",
      "file_size_bytes": 62044,
      "width": 640,
      "height": 480,
      "sha256": "541354ee51ac12cb5435c558ce390e1bed346b89eb64409571f7e2e42d3ac1e9"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}