{
  "mushroom_id": "mersum",
  "scientific_name": "Meripilus sumstinei",
  "common_name": "Meripilus sumstinei",
  "edibility": "E",
  "description": "Large compound rosette 8-24+ inches wide composed of many overlapping fan-shaped caps 2-6 inches wide arising from central base. Pale tan to brown caps that BLACKEN when bruised or with age - diagnostic feature. White to cream pore surface that also blackens. Soft and spongy texture. Can weigh 10-30+ pounds. Distinctive black staining.",
  "habitat": "Saprobic and parasitic at bases of living and dead hardwood trees, particularly oak, maple, beech, and elm. Causes white rot of roots and lower trunk. Forms large rosettes at tree bases, stumps, and buried roots. Common in mature hardwood forests and urban settings.",
  "season": "Late summer through fall, typically July-October. Peak fruiting in August-September. Can flush multiple times per season. Most abundant in late summer. Often in same location annually.",
  "regions": [
    "Eastern North America",
    "Midwest",
    "Southeastern United States",
    "Great Lakes region",
    "Pacific Northwest",
    "Widespread across North America"
  ],
  "lookalikes": [
    "Grifola frondosa (gray-brown, doesn't blacken, different cap arrangement)",
    "Bondarzewia berkeleyi (lighter, larger caps, doesn't blacken quickly)",
    "Other large polypore rosettes (don't blacken when handled)",
    "Polyporus umbellatus (smaller, different structure)"
  ],
  "safety_notes": "EDIBLE when very young but not choice: Only tender young specimens are palatable - older ones become tough and bitter. The rapid black staining when touched is distinctive but doesn't affect edibility of young specimens. Must be cooked thoroughly. Generally not sought after due to mediocre flavor and tendency to cause digestive upset in some people. Harvest only very young, white, tender portions. Better edible polypores exist.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1688474.jpg",
      "photographer": "Crystal (Squirrelgirl)",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-07-27",
      "file_size_bytes": 86536,
      "width": 482,
      "height": 640,
      "sha256": "d11d8bcfd4625365125d32a50af1e5f58bde58d9859e3f55d5d9057146549163"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1688475.jpg",
      "photographer": "Crystal (Squirrelgirl)",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-07-27",
      "file_size_bytes": 89766,
      "width": 482,
      "height": 640,
      "sha256": "14784a9de79f16b8dd7a16e1acd87da31b87a5c26de5c66af1759e7beaa1afac"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}