{
  "mushroom_id": "herame",
  "scientific_name": "Hericium americanum",
  "common_name": "Bear's Head Tooth",
  "edibility": "E",
  "description": "Bear's Head has a white, branched structure forming a large cluster (15-40 cm wide) with multiple SHORT BRANCHES that each bear clusters of hanging SPINES on their undersides. The main structure consists of thick, fleshy branches with spines (0.5-2 cm long) growing only on the lower surfaces of branches, not all around. Spines are white when fresh, yellowing with age. The entire fruiting body is attached to wood at a single point. Flesh is white, firm, with mild taste. Distinguished from H. erinaceus by its branched structure and from H. coralloides by shorter, thicker branches with spines only underneath.",
  "habitat": "Saprobic on hardwood trees, especially oak, beech, and maple. Grows on dead or dying standing trees, logs, and stumps. Typically fruits from wounds or decay cavities. Not mycorrhizal. Usually appears singly on a tree.",
  "season": "Late summer through fall (August-November), occasionally into early winter.",
  "regions": [
    "Eastern United States",
    "Midwest",
    "Southeast",
    "Rocky Mountains"
  ],
  "lookalikes": [
    "Hericium erinaceus (Lion's Mane) - unbranched pom-pom structure",
    "Hericium coralloides (Coral Tooth) - extensively branched, spines all around branches",
    "Hericium abietis - grows on conifers, more compact branching"
  ],
  "safety_notes": "CHOICE EDIBLE: Excellent flavor, similar to H. erinaceus with mild, sweet, seafood-like taste. No toxic lookalikes due to distinctive white spiny appearance. Best when fresh and pure white - yellowing indicates age. Clean gently to remove debris from spines. The branched structure distinguishes it from the compact Lion's Mane.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1719033.jpg",
      "photographer": "Huafang",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-04",
      "file_size_bytes": 57254,
      "width": 640,
      "height": 482,
      "sha256": "4ac9fe480e1a633010363f9ec99b70d933e57e90422bb5dab4a766109be5c41d"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1705306.jpg",
      "photographer": "Huafang",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-08-31",
      "file_size_bytes": 32562,
      "width": 640,
      "height": 482,
      "sha256": "e4f44d924b5441615ed855220bb55bdb42da4c4d242252f2b659c11ab0418b19"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}