{
  "mushroom_id": "hydrep",
  "scientific_name": "Hydnum repandum",
  "common_name": "Sweet Tooth",
  "edibility": "E",
  "description": "Sweet Tooth has an irregularly shaped cream to pale orange cap (3-15 cm) with a wavy, lobed margin. The distinctive feature is the underside covered with brittle, downward-pointing SPINES or TEETH instead of gills or pores - these spines are cream to pale orange, easily detached when rubbed. The stem is off-center to central, thick, white to pale orange, smooth, and often curved. The flesh is white, thick, brittle, with a mild taste and pleasant odor. Spore print is white. This easily identified edible has a slightly peppery taste when raw that disappears with cooking.",
  "habitat": "Mycorrhizal with both hardwoods and conifers. Found on the ground in mixed forests, under oak, beech, pine, and spruce. Often grows scattered or in small groups. Prefers well-drained soil, commonly found in moss or leaf litter.",
  "season": "Summer through fall (July-November), with peak fruiting in fall. In milder climates may fruit into early winter.",
  "regions": [
    "Pacific Northwest",
    "Northeast",
    "Midwest",
    "Southeast",
    "Rocky Mountains",
    "Europe"
  ],
  "lookalikes": [
    "Hydnum umbilicatum (Depressed Hedgehog) - smaller, more orange, depressed center",
    "Hydnum albidum (White Hedgehog) - pure white color",
    "Hydnum rufescens (Terracotta Hedgehog) - darker orange-brown color",
    "Sarcodon species - larger, darker, often bitter taste"
  ],
  "safety_notes": "CHOICE EDIBLE: Sweet and mild flavor when cooked, though may be slightly peppery when raw. Collect young specimens for best texture - older specimens can become tough or develop bitter taste. The distinctive spines/teeth on the underside make misidentification with toxic species unlikely. Clean thoroughly as spines trap debris. May cause mild digestive upset in sensitive individuals if consumed in large quantities.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1714441.jpg",
      "photographer": "purplecloud",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-06",
      "file_size_bytes": 99832,
      "width": 640,
      "height": 480,
      "sha256": "e3445093a421555636805635d3ce11d27c8e580b4ef979bccb1b9b4e7636568c"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1493456.jpg",
      "photographer": "Scott Ostuni",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2022-08-31",
      "file_size_bytes": 101492,
      "width": 640,
      "height": 480,
      "sha256": "707eb43113263b918093c6b9ce0ebcd8da779fe0e9b863d6899aced3d04f9f6d"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:54:02.596413"
}