{
  "mushroom_id": "lepsor",
  "scientific_name": "Lepista sordida",
  "common_name": "Sordid Blewit",
  "edibility": "E",
  "description": "The Sordid Blewit is a smaller paler cousin of the Wood Blewit. Cap 3-8 cm across, convex becoming flat or slightly depressed, pale lilac-gray to brownish-lilac or buff-tan. The purple coloration is subtle and fades quickly to dingy tan-brown (hence \"sordid\"). The surface is smooth, dry to slightly greasy. The gills are adnate to slightly decurrent, pale lilac becoming tan-buff. The stem is 3-7 cm tall, slender, pale lilac to buff with a slightly enlarged base. The flesh is thin, pale, with a sweet slightly fruity odor (less pronounced than L. nuda).",
  "habitat": "Found in grasslands, pastures, lawns, meadows, grassy woodland edges, and parks. Grows as a grass and humus decomposer in nitrogen-rich soil. Fruits scattered to gregarious, often in fairy rings or troops in grass. Prefers open grassy areas rather than forests.",
  "season": "Late summer through fall (August-November) in temperate regions. Can fruit into early winter in mild climates. Peak fruiting in September-October.",
  "regions": [
    "Europe (common)",
    "North America (less common)",
    "Temperate grasslands worldwide",
    "Parks and pastures",
    "Cosmopolitan in suitable habitats"
  ],
  "lookalikes": [
    "Lepista nuda (edible) - darker purple, larger, woodland habitat",
    "Clitocybe species - some toxic, pale colors, different odors",
    "Entoloma species (some toxic) - pink spores but angular, flesh fragile",
    "Laccaria laccata (edible) - smaller, more hygrophanous, woodland"
  ],
  "safety_notes": "EDIBLE with caution: Considered edible but less desirable than L. nuda. Must be thoroughly cooked - NEVER eat raw. The pale colors and dingy appearance make it less appealing and harder to identify confidently. Some people report digestive upset. Try small amounts first. Verify PINK SPORE PRINT. The subtle purple tones, grassland habitat, and sweet odor are diagnostic but not distinctive. Not recommended for beginners due to pale colors and confusion risks. Cook thoroughly if attempting. The \"sordid\" dingy appearance is accurate. Better blewits exist.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1548011.jpg",
      "photographer": "Glen van Niekerk",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-02-18",
      "file_size_bytes": 31928,
      "width": 480,
      "height": 640,
      "sha256": "8028f87a93744bb9101150c84d03670677f1580e148d30259312e525f7b55d76"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1548012.jpg",
      "photographer": "Glen van Niekerk",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-02-18",
      "file_size_bytes": 29522,
      "width": 640,
      "height": 480,
      "sha256": "8c618cc4b080f4a37b0ecd5fb16ac270616d9cb6bfc1137157b215b5295b0bd2"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}