{
  "mushroom_id": "copatr",
  "scientific_name": "Coprinopsis atramentaria",
  "common_name": "Common Ink Cap",
  "edibility": "E",
  "description": "Common Inky Cap or Tippler's Bane is a medium-sized mushroom 5-15 cm tall with a cap 3-7 cm across. The cap is oval to bell-shaped, gray-brown to tan with a pale gray to brown scurfy surface (covered with tiny scales or fibers). The center is often slightly darker. The gills are free to adnate, white becoming gray then black and deliquescing into ink. The stem is 8-15 cm tall, smooth, white, hollow, with a small fragile ring zone. Fruits in dense clusters from buried wood or organic matter.",
  "habitat": "Found in lawns, gardens, parks, wood chip mulch, compost areas, and near stumps or buried wood. Grows as a wood decomposer, often on buried hardwood debris. Very common in urban and suburban landscapes. Fruits in dense tight clusters, often in large numbers. Prefers nutrient-rich disturbed soils.",
  "season": "Spring through fall (April-November) in temperate regions. In mild climates may fruit year-round. Most abundant in late summer and fall. Can appear in large flushes after rains.",
  "regions": [
    "North America (very common, widespread)",
    "Europe (very common)",
    "Worldwide in temperate regions",
    "Urban areas globally",
    "Cosmopolitan distribution"
  ],
  "lookalikes": [
    "Coprinus comatus (edible) - taller, shaggy white scales, no alcohol interaction",
    "Coprinellus micaceus (edible) - mica-like particles on cap, smaller",
    "Coprinopsis species - many similar gray inky caps",
    "Psathyrella species - similar but don't deliquesce as readily"
  ],
  "safety_notes": "CAUTION - ALCOHOL INTERACTION: Coprinopsis atramentaria contains coprine, which blocks alcohol metabolism and causes severe reactions when combined with alcohol. DO NOT consume alcohol 24 hours before or up to 72 hours after eating this mushroom. Symptoms include facial flushing, nausea, vomiting, palpitations, tingling in limbs, headache, and chest pain. When properly cooked and consumed without alcohol, this mushroom is edible, but the serious interaction risk makes it unsuitable for most foragers.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1723335.jpg",
      "photographer": "purplecloud",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-06",
      "file_size_bytes": 51172,
      "width": 640,
      "height": 480,
      "sha256": "d9f845c360fd59b871bda93baaa0c0830a86fec122b83661c898ff70e174b1ae"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1659341.jpg",
      "photographer": "Kevin Fox",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-03-03",
      "file_size_bytes": 67868,
      "width": 353,
      "height": 640,
      "sha256": "9446ede186e58a31d122204a1fc0a987c47e238da67bdaec005abb33923e7814"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:53:05.984277"
}