{
  "mushroom_id": "coplag",
  "scientific_name": "Coprinopsis lagopus",
  "common_name": "Hare's Foot Inkcap",
  "edibility": "E",
  "description": "Hare's Foot Inky Cap is a small delicate mushroom 4-10 cm tall with a cap 2-5 cm across. The cap is oval to bell-shaped, white to pale gray-brown, covered with dense white cottony or woolly hairs especially when young, giving a furry appearance (like a hare's foot, hence the name). The surface has long silky fibers. The gills are free, white becoming gray then black and deliquescing. The stem is 4-10 cm tall, slender, white, covered with similar woolly hairs, hollow. The entire mushroom has a shaggy hairy appearance.",
  "habitat": "Found in grassy areas, lawns, pastures, parks, roadside verges, and disturbed ground. Prefers nutrient-rich soil, often where livestock graze or near dung. Grows terrestrially in grass, fruits scattered to gregarious. Common in maintained grasslands and grazed areas.",
  "season": "Spring through fall (May-November) in temperate regions. Peak fruiting in late spring and summer. In warm climates may fruit into winter. Most common during warm humid weather.",
  "regions": [
    "Europe (widespread)",
    "North America (less common)",
    "Temperate grasslands worldwide",
    "Grazed pastures",
    "Cosmopolitan in suitable habitats"
  ],
  "lookalikes": [
    "Coprinus comatus (edible) - much larger, shaggy scales not cottony hairs",
    "Coprinopsis lagopides - nearly identical, distinction requires microscopy",
    "Young Agaricus or Amanita - but lack the cottony surface and black deliquescing gills",
    "Parasola species - smaller, less hairy"
  ],
  "safety_notes": "EDIBLE but poor: Considered edible when young but the flavor is bland and texture poor. The small size and delicate nature make it impractical. No toxic properties known but not commonly collected. No alcohol interaction. Must be used immediately as gills deliquesce quickly. Only young specimens before gills turn black are edible. The woolly-hairy appearance is charming but doesn't translate to culinary quality. Safe but not worthwhile. No toxic lookalikes. The cottony white hairs give it an attractive furry appearance. More interesting as a specimen than food.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1723677.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-09",
      "file_size_bytes": 80168,
      "width": 640,
      "height": 480,
      "sha256": "eb65a2e8b50fd754a18e94db92f351c950f6aad16c9436862b1b4e582849bcf9"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1723658.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-08",
      "file_size_bytes": 69772,
      "width": 640,
      "height": 524,
      "sha256": "12799b2ca72edccdf51732a8de50992a20502b6b4f9c593c8dcde2c35988af72"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}