{
  "mushroom_id": "cancin",
  "scientific_name": "Cantharellus cinnabarinus",
  "common_name": "Cinnabar Chanterelle",
  "edibility": "E",
  "description": "The Cinnabar Chanterelle (Red Chanterelle) is a small, distinctive mushroom with a bright cinnabar-red to pinkish-red cap 1-4 cm wide. The cap is smooth to slightly velvety, becoming shallowly funnel-shaped with age, with wavy margins. The underside features blunt, shallow, forked ridges (NOT true gills) that are pinkish-red to salmon-pink, often paler than the cap, and run down the stem. The stem is solid, slender, 2-5 cm tall, same color as cap or slightly paler. Flesh is pinkish-white, thin but firm, with a mild odor. Spore print is white to pale pink.",
  "habitat": "Mycorrhizal with eastern hardwoods, particularly oak (Quercus species), American beech, and hickory. Found in mature deciduous and mixed forests, often in the same habitats as other eastern chanterelles. Prefers well-drained slopes with rich, acidic leaf litter.",
  "season": "Summer (June-September), fruiting during warm, humid periods after summer rains. Peak season is typically July-August. Often fruits alongside C. lateritius and C. appalachiensis in eastern forests.",
  "regions": [
    "Eastern United States",
    "Southeastern states (especially Carolinas, Tennessee)",
    "Appalachian region",
    "Mid-Atlantic states",
    "Ohio River Valley"
  ],
  "lookalikes": [
    "Cantharellus lateritius - Edible, larger, more orange-pink than red, similar habitat and season",
    "Jack-O'-Lantern (Omphalotus illudens) - TOXIC, has true sharp-edged gills, grows on wood, more orange than red",
    "Hygrocybe species (waxcaps) - Variable edibility, have true gills, more fragile texture, smaller"
  ],
  "safety_notes": "EDIBLE: The Cinnabar Chanterelle is an edible mushroom notable for its small size and distinctive bright red color. Like all chanterelles, the key identification feature is the blunt, forked ridges rather than true gills. These ridges are shallow but distinctly waxy and fused to the cap. The bright cinnabar-red color and small size make it relatively easy to identify among chanterelles. Due to its small size, it's often collected along with other chanterelle species. Flavor is mild; best used fresh or combined with other mushrooms.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1700417.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-08-20",
      "file_size_bytes": 27518,
      "width": 640,
      "height": 427,
      "sha256": "a998a577154e7fbb29aa9e7ff8a03d85904bd6a1dafecadc5a106e7060fa4d47"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1700418.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-08-20",
      "file_size_bytes": 47598,
      "width": 640,
      "height": 427,
      "sha256": "5cbe77df51c2eb2f433f2f537ca28b74a956cf29511aa7a93ef36483ee482530"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T00:00:00.000000"
}