{
  "mushroom_id": "morimp",
  "scientific_name": "Morchella importuna",
  "common_name": "Morchella importuna",
  "edibility": "E",
  "description": "Fruiting body 6-20 cm (2.4-8 in) high overall. Cap 3-15 cm (1.2-6 in) tall, 2-9 cm wide at widest point, conical to widely conical or occasionally egg-shaped, with distinctive ladder-like honeycomb pattern featuring 12-20 prominent primary vertical ridges intersected by numerous horizontal ridges creating rectangular pits. Color typically darker than yellow morels, ranging from tan to brown to grayish-brown. Stem hollow, proportional to cap. Completely hollow when sectioned. Spore print cream.",
  "habitat": "Distinctive urban and landscape morel found in wood chip mulch beds, gardens, fire pits, planters, landscaped areas, and disturbed ground in residential and commercial settings. Unlike most morels which are mycorrhizal, M. importuna is largely saprotrophic (decomposes wood chips and organic matter independently). Strongly associated with fresh wood chip mulch in ornamental plantings, parks, and urban green spaces. Rarely found in natural forest settings.",
  "season": "Spring (March-May in most regions, timing varies with local climate). In California and Pacific Northwest can fruit February-April. Emergence often triggered by moisture following wood chip application in previous season. May fruit in same mulched locations for multiple consecutive years.",
  "regions": [
    "Pacific Northwest",
    "California",
    "Midwest",
    "Northeast",
    "Mid-Atlantic"
  ],
  "lookalikes": [
    "False Morel (Gyromitra species) - TOXIC: brain-like lobed cap instead of ladder-like ridges, cap attached only at top of stem, chambered interior, reddish-brown color. Deadly toxic even when cooked.",
    "Other black morels (Morchella elata group) - Edible: similar appearance but typically in natural forest settings rather than landscape mulch, difficult to distinguish visually, all edible with proper cooking.",
    "Half-Free Morel (Morchella punctipes) - Edible: cap attached halfway down stem creating skirt, rather than fully attached along length.",
    "Morchella tomentosa - Edible: fuzzy/hairy texture when young especially at stem base, found in post-fire conifer sites vs. urban landscapes."
  ],
  "safety_notes": "CHOICE EDIBLE: Highly prized culinary mushroom, now commercially cultivated in Asia producing hundreds of tons annually. Must be thoroughly cooked for 15-25 minutes minimum; raw or undercooked morels contain hydrazine toxins causing severe nausea, vomiting, and gastric upset. Cook at temperatures above 160°F (71°C) to destroy toxic compounds. Some individuals experience allergic reactions even when properly cooked; try small portions initially. Avoid consuming with alcohol due to rare documented adverse interactions. Ensure proper identification to distinguish from deadly false morels (Gyromitra) which have brain-like wrinkled caps. When foraging from landscape mulch, verify no pesticides or herbicides were applied to area.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1751485.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2025-04-12",
      "file_size_bytes": 61022,
      "width": 640,
      "height": 480,
      "sha256": "3f486307fe8bc9b853309c9d16f0e5a3baa20133c6f1468621bbd300e2a405cc"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1751432.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2025-04-11",
      "file_size_bytes": 64566,
      "width": 640,
      "height": 480,
      "sha256": "788ee443df988d03a975784a7e4493e160afd271619e90d83e1011258704f823"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T19:30:00.000000"
}