{
  "mushroom_id": "sparad",
  "scientific_name": "Sparassis radicata",
  "common_name": "Sparassis radicata",
  "edibility": "E",
  "description": "Rooting Cauliflower is similar to S. crispa, forming cream to golden-yellow masses 10-30 cm across resembling cauliflower. The fruitbody consists of numerous thin frilled wavy lobes or flattened branches from a central base. Color is typically brighter yellow to golden-yellow than S. crispa. The texture is crisp when fresh. The base has a distinct rooting structure (radicating base) that extends deep into the soil to reach buried hardwood roots. The lobes are densely crisped and packed.",
  "habitat": "Found at the base of hardwood trees, particularly oak, rarely on conifers. Grows as a root parasite on living trees or from buried roots of dead hardwoods. The rooting base extends deep to reach roots. Fruits at tree bases, appearing to emerge from the ground. Prefers mature hardwood forests.",
  "season": "Late summer through fall (August-November) in most regions. Peak fruiting in fall. Can return to the same location for multiple years. Requires warm summer followed by fall rains.",
  "regions": [
    "Eastern North America (uncommon)",
    "Europe (widespread but uncommon)",
    "Temperate hardwood forests",
    "Oak forests",
    "Less common than S. crispa overall"
  ],
  "lookalikes": [
    "Sparassis crispa (edible) - very similar but on conifers, paler colored",
    "Sparassis spathulata (edible) - western species, similar appearance",
    "Hen of the Woods Grifola (edible) - gray-brown rosettes, different texture",
    "No toxic lookalikes"
  ],
  "safety_notes": "CHOICE EDIBLE: Excellent edible mushroom with flavor and texture similar to S. crispa. Highly prized where found. The crisp texture and mild flavor are outstanding. Excellent in various dishes. Clean very thoroughly as the structure traps debris. Best when fresh and pale colored. Older specimens become tough. Cook thoroughly. The appearance is distinctive with no dangerous lookalikes. Uncommon but worth seeking. The rooting base (radicating) and association with hardwoods (especially oak) distinguish from S. crispa on conifers. Returns to same locations when conditions are right.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1641786.jpg",
      "photographer": "Chitin-da-breeze",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-01-01",
      "file_size_bytes": 66534,
      "width": 640,
      "height": 591,
      "sha256": "bcbd753dd1d35cb3b8dcb17a2e09c8514ce77c188f0464c6f45cd12f5fb2125b"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1608950.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-10-06",
      "file_size_bytes": 126206,
      "width": 480,
      "height": 640,
      "sha256": "6cd4eb6fcfc3e41a5c6b91f561a2396b6d38cef36f550bd9a10a4c641ca84782"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}