{
  "mushroom_id": "clineb",
  "scientific_name": "Clitocybe nebularis",
  "common_name": "Clouded Funnel",
  "edibility": "E",
  "description": "The Clouded Clitocybe or Cloudy Funnel is a large robust mushroom with a cap 8-20 cm across, initially convex with inrolled margin becoming flat to funnel-shaped with age. The cap is grayish-brown, gray-tan, or clouded gray (like a cloudy sky), often with darker and lighter zones giving a streaky appearance. The surface is smooth, dry to greasy. The gills are adnate to slightly decurrent, crowded, white to cream. The stem is 6-12 cm tall, stout, pale gray to buff, fibrous. The flesh is thick, white, with a strong sweet floral or sickly-sweet odor (not always pleasant).",
  "habitat": "Found in deciduous and coniferous forests, woodland edges, and leaf litter. Grows as a litter decomposer in rich humus. Fruits scattered to gregarious, often in large troops or fairy rings. Prefers areas with abundant organic matter and deep leaf litter.",
  "season": "Late summer through fall and early winter (September-December). Fruits into winter in mild climates. One of the late-season mushrooms appearing after frosts. Peak in late fall (October-November).",
  "regions": [
    "Europe (very common)",
    "Eastern North America (common)",
    "Pacific Northwest (common)",
    "Temperate forests worldwide",
    "Cosmopolitan in leaf litter"
  ],
  "lookalikes": [
    "Clitocybe species (some deadly) - many similar gray-brown species, some toxic",
    "Entoloma sinuatum (toxic) - similar size and colors but pink spores and no sweet odor",
    "Lepista species - purple-toned, pink spores",
    "Hygrophorus species - waxy gills, different habitat"
  ],
  "safety_notes": "EDIBLE BUT CAUTION: Considered edible by some but CAUSES DIGESTIVE UPSET in many people and is NOT RECOMMENDED. Can cause nausea, vomiting, and diarrhea even when properly cooked. Some sources consider it suspect or inedible. The risk of confusion with toxic Clitocybe species is high. The strong sweet odor is distinctive but not always pleasant. Even if correctly identified, many people cannot tolerate it. Better edibles exist. If attempting, cook thoroughly, try tiny amounts first, and prepare for possible upset. The clouded gray-brown cap and sweet odor are diagnostic. NOT recommended due to widespread reports of illness and confusion risks.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1725219.jpg",
      "photographer": "(c) Myles McSweeney, all rights reserved",
      "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
      "observation_date": "2024-10-19",
      "file_size_bytes": 81968,
      "width": 480,
      "height": 640,
      "sha256": "f8ae6f9c3be27230a239ee41370dc50235addd10926c1999c368e9f9a4ba2f91"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1651552.jpg",
      "photographer": "",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-01-13",
      "file_size_bytes": 48724,
      "width": 482,
      "height": 640,
      "sha256": "69e102213907378df2fda9a002305293be980dd54056e379244b879f45102cd4"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:54:26.271746"
}