{
  "mushroom_id": "rambot",
  "scientific_name": "Ramaria botrytis",
  "common_name": "Ramaria botrytis",
  "edibility": "E",
  "description": "Pink-tipped Coral is a large handsome coral fungus 8-15 cm tall and 7-12 cm wide. The fruitbody has a thick white to pale pink base (2-4 cm wide) supporting numerous upright branches. The branches are white to pale yellowish, with distinctive wine-red to rose-pink tips (diagnostic feature). Young specimens have more vibrant pink coloring. The branching is dense and compact. The flesh is white, brittle when fresh, with a mild pleasant odor. The entire structure is fleshy and cauliflower-like.",
  "habitat": "Found in hardwood and coniferous forests, forming mycorrhizal associations particularly with beech, oak, and spruce. Grows terrestrially from soil or well-rotted wood. Fruits scattered to gregarious in rich humus. Prefers mature forests with abundant organic matter. Common in mixed forests.",
  "season": "Late summer through fall (August-November) in temperate regions. In Europe, primarily September-October. Peak fruiting occurs in early fall. Requires warm summer followed by fall rains.",
  "regions": [
    "Europe (widespread, common)",
    "Eastern North America (uncommon)",
    "Pacific Northwest (rare)",
    "Northern temperate forests",
    "Particularly abundant in Europe",
    "Rocky Mountains (occasional)"
  ],
  "lookalikes": [
    "Ramaria formosa (toxic) - salmon-orange branches without distinct pink tips",
    "Ramaria aurea (edible) - golden-yellow throughout, no pink tips",
    "Ramaria rubripermanens (edible) - entire fruitbody stains red when handled",
    "Other Ramaria species - many similar, identification difficult"
  ],
  "safety_notes": "EDIBLE: Considered one of the finest coral fungi with good flavor and texture when young. Highly regarded in Europe. Cook thoroughly. Only collect young firm specimens before they become waterlogged or wormy. The flavor is mild and mushroomy. Discard the tough base. CRITICAL: The wine-red to pink branch tips are diagnostic and help distinguish from toxic species. Some coral fungi cause digestive upset in sensitive people. Avoid bitter-tasting specimens. The pink tips must be clearly visible. Try small amounts first. More reliable and safer than many coral fungi.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1714687.jpg",
      "photographer": "purplecloud",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-07",
      "file_size_bytes": 29446,
      "width": 640,
      "height": 480,
      "sha256": "fc4845126cad5a597d358e912fddbbe5fa0c1b55aa2837a88713ddac9cc67245"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1714688.jpg",
      "photographer": "purplecloud",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-07",
      "file_size_bytes": 34460,
      "width": 640,
      "height": 480,
      "sha256": "fc67458e097361f0f3f6bf23374d7b10551d60426fb10171557abde9cb880cf8"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}