{
  "mushroom_id": "craign",
  "scientific_name": "Craterellus ignicolor",
  "common_name": "Flame-colored Chanterelle",
  "edibility": "E",
  "description": "The Flame Chanterelle (also called Golden Chanterelle of the East or Flame-colored Chanterelle) has a golden-yellow to bright orange-yellow cap 2-8 cm wide that becomes deeply funnel-shaped with age. The cap margin is thin, wavy, and often perforated in the center, opening into the hollow stem. The underside features shallow, blunt, forked ridges (NOT true gills) that are golden-yellow to orange-yellow, widely spaced, and run down the stem. The stem is 3-10 cm tall, hollow, slender, bright yellow to orange-yellow throughout. Flesh is thin, yellow to orange, with a mild fruity odor. Spore print is white to pale yellow.",
  "habitat": "Mycorrhizal with eastern hardwoods, particularly oak (especially white oak, red oak), American beech, and hickory. Found in mature deciduous forests, often in mossy areas or on well-drained slopes. Grows scattered or in troops on the forest floor among leaf litter.",
  "season": "Summer through fall (July-October), fruiting during warm, humid periods after summer rains. Peak season is typically August-September in most of its range. Can produce multiple flushes throughout the season.",
  "regions": [
    "Eastern United States",
    "Southeastern states (especially Carolinas, Tennessee, Georgia)",
    "Appalachian region",
    "Mid-Atlantic states",
    "Ohio River Valley"
  ],
  "lookalikes": [
    "Craterellus tubaeformis - Edible, more brownish cap with yellow stem, found further north with conifers",
    "Small Cantharellus species (C. cinnabarinus, C. minor) - Edible, more solid stem (not hollow), otherwise similar",
    "Hygrophoropsis aurantiaca (False Chanterelle) - Not toxic but poor quality, has true thin gills, more orange"
  ],
  "safety_notes": "EDIBLE: The Flame Chanterelle is an excellent edible mushroom with good flavor and a distinctive appearance. The combination of golden-yellow color, funnel shape, hollow stem, and blunt ridges (not true gills) makes it relatively easy to identify. The hollow stem throughout distinguishes it from solid-stemmed Cantharellus species. No toxic lookalikes exist. Often found in large numbers, making it a worthwhile forage. Flavor is pleasant and slightly fruity; excellent sautéed, in soups, or dried for later use.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1716729.jpg",
      "photographer": "Jess Evans",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-12",
      "file_size_bytes": 59018,
      "width": 479,
      "height": 640,
      "sha256": "f3fae7e1255a0ae7a2792a65838543cf197bb4cf15b6d6d737220fe368e0065e"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1691765.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-08-05",
      "file_size_bytes": 36078,
      "width": 640,
      "height": 427,
      "sha256": "1836de388cd2ce82bb1b3fa93695bf67badd48b7368ce1dc8f5fc6c0d6565505"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T00:00:00.000000"
}