{
  "mushroom_id": "lacruf",
  "scientific_name": "Lactarius rufus",
  "common_name": "Red Hot Milk Cap",
  "edibility": "E",
  "description": "Red Hot Milk Cap has a reddish-brown to rufous cap (4-10 cm) with a distinctive small central umbo (nipple). The cap surface is dry, smooth to slightly velvety. Gills are cream to pale pinkish, attached, crowded. The stem is similar color to cap, smooth, hollow. The KEY FEATURE is the copious WHITE LATEX (milk) that exudes when cut or broken - this latex is EXTREMELY ACRID and hot-tasting. The latex does not change color. Flesh is pale, fragile. Spore print is white to cream. The acrid latex is comparable to habanero pepper heat.",
  "habitat": "Mycorrhizal with CONIFERS, especially pine and spruce. Grows on the ground in coniferous and mixed forests, often in acidic soils and sphagnum moss. Common in northern conifer forests. Prefers wet, boggy areas.",
  "season": "Summer through fall (July-October), fruiting throughout the season.",
  "regions": [
    "Northeast",
    "Pacific Northwest",
    "Upper Midwest",
    "Rocky Mountains",
    "Canada",
    "Northern Europe"
  ],
  "lookalikes": [
    "Other Lactarius species - test latex taste to distinguish (nibble and spit - mild vs acrid)",
    "Russula emetica - similar red color but NO LATEX, brittle flesh",
    "Lactarius hepaticus - similar but darker brown, equally acrid"
  ],
  "safety_notes": "INEDIBLE: Lactarius rufus, known as the Rufous Milkcap or Red Hot Milk Cap, has extremely hot, acrid-tasting milk (latex) that exudes when cut - described as the hottest of all Lactarius species, comparable to habanero pepper heat. While it has traditional culinary uses in some Northern European countries after extensive preparation, Western field guides universally classify it as inedible due to the intensely acrid, peppery taste. The mushroom is suspected of being mildly poisonous when consumed raw or improperly prepared. Not recommended for consumption.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1722544.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-30",
      "file_size_bytes": 41822,
      "width": 640,
      "height": 427,
      "sha256": "60bf73eba948d84dc255c36c3d8f6481b283df81d56eaee0f65fac3c49ff7337"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1722545.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-30",
      "file_size_bytes": 37488,
      "width": 640,
      "height": 427,
      "sha256": "223de6d1c89da3907a4528476c77c1079f062493de4a910a1d94cf2d1ef57123"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T21:30:00.000000"
}