{
  "mushroom_id": "herabi",
  "scientific_name": "Hericium abietis",
  "common_name": "Bear's Head Tooth",
  "edibility": "E",
  "description": "Conifer Coral Hedgehog has a white, branched structure (10-25 cm wide) with moderately branched coral-like appearance, distinguished by growing exclusively on CONIFER wood. The branches bear clusters of hanging SPINES (0.5-2 cm long) primarily on lower surfaces but sometimes partially around branches. Branches are white, fleshy, less extensively divided than H. coralloides. The entire fruiting body is white when fresh, yellowing or browning with age. Flesh is white, firm, with mild taste. Distinguished primarily by conifer host and intermediate branching between H. americanum and H. coralloides.",
  "habitat": "Saprobic on CONIFER wood, especially fir, spruce, hemlock, and pine. Grows on dead logs, standing dead trees, and stumps of conifers. This is the only Hericium species that regularly grows on coniferous trees. Not mycorrhizal. Usually appears singly on a log or tree.",
  "season": "Late summer through fall (September-November), often later than hardwood Hericium species.",
  "regions": [
    "Pacific Northwest",
    "Rocky Mountains",
    "Northern United States",
    "Canada",
    "Northern Europe"
  ],
  "lookalikes": [
    "Hericium coralloides - grows on hardwoods, more extensively branched",
    "Hericium americanum - grows on hardwoods, thicker branches",
    "Climacodon septentrionalis - similar but has larger teeth, different structure"
  ],
  "safety_notes": "EDIBLE: Good flavor similar to other Hericium species, though sometimes slightly more bitter. The white spiny appearance and exclusive association with conifer wood makes identification straightforward. No toxic lookalikes exist. Best when fresh and pure white - yellowing or browning indicates age. Clean gently to remove conifer debris from spines.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1714426.jpg",
      "photographer": "purplecloud",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-06",
      "file_size_bytes": 59586,
      "width": 640,
      "height": 480,
      "sha256": "64ad0f9013daa01c68572b668c9906b6093066007124fbd95e76e9cd73bc0db5"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1658775.jpg",
      "photographer": "Aaron Miller",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-01-13",
      "file_size_bytes": 45632,
      "width": 640,
      "height": 480,
      "sha256": "8df4a3bad659adc85c7166e5684a14c98f94895920a7cda2aca912c464780318"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}