{
  "mushroom_id": "hercor",
  "scientific_name": "Hericium coralloides",
  "common_name": "Coral Tooth",
  "edibility": "E",
  "description": "Coral Tooth has a white, extensively BRANCHED coral-like structure (10-30 cm wide) with numerous thin, delicate branches that repeatedly subdivide. The spines (0.5-1.5 cm long) grow ALL AROUND the branches in tufts or clusters, not just on undersides - creating a fuzzy, bristly appearance on all branch surfaces. Branches are slender, round in cross-section, intricately divided. The entire structure is white when fresh, yellowing with age. Flesh is white, tender, with mild taste. Distinguished by its highly branched coral-like form with spines completely encircling branches.",
  "habitat": "Saprobic on hardwood trees, especially oak, beech, maple, and birch. Grows on dead logs, standing dead trees, and stumps. Typically fruits from well-decayed wood. Not mycorrhizal. Usually appears singly on a log or tree.",
  "season": "Late summer through fall (August-October), occasionally into early winter in mild climates.",
  "regions": [
    "Eastern United States",
    "Midwest",
    "Pacific Northwest",
    "Rocky Mountains",
    "Canada",
    "Europe"
  ],
  "lookalikes": [
    "Hericium americanum (Bear's Head) - spines only on branch undersides, thicker branches",
    "Hericium erinaceus (Lion's Mane) - unbranched globular mass",
    "Hericium abietis - grows on conifers, less extensively branched"
  ],
  "safety_notes": "CHOICE EDIBLE: Excellent mild, sweet flavor similar to other Hericium species. The distinctive white coral-like branching with spines all around branches makes misidentification unlikely. No toxic lookalikes exist. Best when fresh and pure white - yellowing indicates age but is still edible. Clean gently to remove debris from intricate branches and spines.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1651556.jpg",
      "photographer": "",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-01-13",
      "file_size_bytes": 36894,
      "width": 482,
      "height": 640,
      "sha256": "7605b8c55e765b1fe0cc47041cc270bbf7bdcb3029275df0eb2b25ae074f4b56"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1651557.jpg",
      "photographer": "",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-01-13",
      "file_size_bytes": 49898,
      "width": 482,
      "height": 640,
      "sha256": "d2c6ed06d552240b64a0f9e3052ce002878adb57269b21d7609b28072c051234"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}