{
  "mushroom_id": "lentig",
  "scientific_name": "Lentinus tigrinus",
  "common_name": "Tiger Sawgill",
  "edibility": "E",
  "description": "Small to medium mushroom with white cap 1-3 inches wide covered in concentric rings of brown to black scales giving tiger-stripe appearance. White serrated (saw-toothed) gills - diagnostic feature. Central white stem 1-3 inches tall, often scaly. Has GILLS with distinctive serrated edges, not pores. Grows on hardwood. Tough, leathery texture. Distinctive tiger-striped pattern.",
  "habitat": "Saprobic on dead hardwood including logs, stumps, branches, and woody debris, particularly willow, alder, poplar, and other riparian hardwoods. Common along streams and rivers. Prefers wet or waterlogged wood. Often on small branches and twigs. Causes white rot.",
  "season": "Spring through fall, typically May-October. Peak in summer. Most common in warm, wet weather. Can appear year-round in mild climates. Fruits prolifically during humid periods.",
  "regions": [
    "Eastern North America",
    "Pacific Northwest",
    "Widespread across North America",
    "Great Lakes region",
    "Riparian areas nationwide",
    "Cosmopolitan distribution"
  ],
  "lookalikes": [
    "Neolentinus lepideus (larger, conifer wood, anise odor, different scales)",
    "Lentinus arcularius (similar but smaller scales, different pattern)",
    "Pleurotus dryinus (scales but no serrated gills)",
    "Panellus species (smooth gill edges, different growth)"
  ],
  "safety_notes": "EDIBLE when very young but not recommended: Only tender young buttons are palatable - rapidly becomes tough and leathery. Even young specimens have chewy texture requiring extensive cooking or drying and powdering. Small size and toughness make it not worth harvesting. Generally safe but unpalatable due to texture. The distinctive serrated gill edges and tiger-striped cap are unique. Better edible mushrooms available.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1721722.jpg",
      "photographer": "Huafang",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-30",
      "file_size_bytes": 51736,
      "width": 640,
      "height": 482,
      "sha256": "0e82849a5dc34798348db9c7f1bfa1f5a3ea4e60a201f43532ef85eb34e51251"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1721723.jpg",
      "photographer": "Huafang",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-30",
      "file_size_bytes": 58200,
      "width": 640,
      "height": 482,
      "sha256": "d9734262995f308da3b0255496f7b5ef96a142c44bbfa98a54bb62f1f1460f5a"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}