{
  "mushroom_id": "trical",
  "scientific_name": "Tricholoma caligatum",
  "common_name": "California Matsutake",
  "edibility": "E",
  "description": "California Matsutake has a robust white to cream cap (5-15 cm) often with brownish stains or zones developing with age. The cap is convex, dry, smooth to slightly scaly or fibrillose. Gills are white to cream, attached, crowded, may stain brown. The stem is thick, firm, white, with a MEMBRANOUS TO COTTONY RING from the partial veil - ring characteristics can vary. The key feature is the DISTINCTIVE SPICY, CINNAMON, or aromatic ODOR. Flesh is white, firm. Spore print is white. Distinguished by California coastal range habitat and association with specific tree species.",
  "habitat": "Mycorrhizal with CONIFERS and hardwoods in California, especially live oak (Quercus agrifolia), tanoak (Notholithocarpus), madrone (Arbutus), and Douglas fir. Forms mycorrhizal relationships in coastal California forests. Grows on the ground in duff or leaf litter. Found in mixed evergreen forests from coastal ranges to Sierra Nevada foothills.",
  "season": "Late fall through winter (November-February), fruiting during California's rainy season - later than other matsutake.",
  "regions": [
    "California coast",
    "Sierra Nevada foothills",
    "Coastal ranges",
    "Northern California",
    "Oregon border region"
  ],
  "lookalikes": [
    "Tricholoma magnivelare - Pacific Northwest matsutake, conifer specific",
    "Other Tricholoma species - various, lack cinnamon odor",
    "Amanita species - TOXIC - have volva at base",
    "Catathelasma - has double veil structure"
  ],
  "safety_notes": "CHOICE EDIBLE: Highly prized, commercially harvested in California. The SPICY CINNAMON ODOR is diagnostic. Best when young and firm. Unique among matsutake for its hardwood associations (oak, tanoak, madrone) in addition to conifers. CRITICAL: Always verify absence of volva (cup at base) to rule out toxic Amanita species. The ring and distinctive aroma confirm identification.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1709829.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-09-23",
      "file_size_bytes": 48448,
      "width": 640,
      "height": 427,
      "sha256": "3d523855db60033f8584ae1a15f1acd6727619de2cbc5db25006025b3844aea8"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1709830.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-09-23",
      "file_size_bytes": 39640,
      "width": 640,
      "height": 427,
      "sha256": "1342cf701d1c7ffb2a2df10c0f7671b8bb3dd32a98a987505432c3b3c9bf7046"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T21:00:00.000000"
}