{
  "mushroom_id": "cantex",
  "scientific_name": "Cantharellus texensis",
  "common_name": "Texas Chanterelle",
  "edibility": "E",
  "description": "The Texas Chanterelle has a smooth, orange-yellow to golden-yellow cap 3-10 cm wide with a slightly velvety texture when young. The cap becomes shallowly funnel-shaped with age and has wavy, irregular margins. The underside features thick, blunt, forked ridges (NOT true gills) that are yellow to orange-yellow, moderately spaced, and run down the stem. The stem is solid, 3-8 cm tall, smooth, yellow to orange-yellow, often tapering downward. Flesh is white to pale yellow, firm, with a mild fruity aroma. Spore print is white to pale yellow.",
  "habitat": "Mycorrhizal primarily with oak species (especially post oak, live oak, and red oak), also found with hickory and pecan in bottomland hardwood forests. Common in oak-dominated woodlands, riparian forests, and parks throughout its range. Prefers sandy, well-drained soils typical of the Gulf Coast plain.",
  "season": "Late spring through summer (May-September), fruiting during warm, humid periods after heavy rains. Peak season is typically June-July in Texas. More tolerant of heat than northern chanterelle species.",
  "regions": [
    "Texas (widespread)",
    "Louisiana",
    "Eastern Oklahoma",
    "Arkansas",
    "Southern Missouri (rare)"
  ],
  "lookalikes": [
    "Jack-O'-Lantern (Omphalotus species) - TOXIC, has true sharp-edged gills, grows on wood, more intensely orange",
    "Cantharellus lateritius - Edible, more pinkish-orange, found further east, similar size and habitat",
    "False Chanterelle (Hygrophoropsis aurantiaca) - Not toxic but poor quality, has true thin gills, more orange"
  ],
  "safety_notes": "EDIBLE: The Texas Chanterelle is a good edible mushroom and an important regional species for foragers in the southern United States. Like all chanterelles, identification relies on the thick, blunt, forked ridges that feel waxy and are continuous with the cap flesh, rather than the thin, blade-like true gills of toxic lookalikes. Always confirm it grows from soil in association with trees, never on wood. Flavor is mild and pleasant; excellent sautéed or in cream sauces. Generally well-tolerated but test with small amounts first.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/530735.jpg",
      "photographer": "Ron Pastorino",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2015-06-14",
      "file_size_bytes": 35332,
      "width": 640,
      "height": 410,
      "sha256": "039ad325445485a3265b7d7b1d48901e12f18bf2759d9161c264fc0efb326162"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/530736.jpg",
      "photographer": "Ron Pastorino",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2015-06-14",
      "file_size_bytes": 79722,
      "width": 640,
      "height": 499,
      "sha256": "7ee8854f4821985cf10e9c7ab9d84a27f54691a06102293fa7f26d0817b47c2e"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:18:57.230118"
}