{
  "mushroom_id": "laesul",
  "scientific_name": "Laetiporus sulphureus",
  "common_name": "Chicken of the Woods",
  "edibility": "E",
  "description": "Striking bright sulfur-yellow to orange bracket fungus forming large overlapping shelves 2-12 inches wide. Upper surface bright orange to salmon, lower pore surface bright sulfur-yellow. Soft, succulent, and chicken-like texture when young, becoming tough and crumbly with age. No stem. Annual fruiting body. White rot fungus with sulfur-yellow pore surface distinctive.",
  "habitat": "Parasitic and saprobic on living and dead hardwood trees, particularly oak, cherry, willow, and other deciduous species. Forms large rosettes or shelving brackets on trunks, stumps, and fallen logs. Causes brown cubical heart rot. Common on oaks in eastern forests.",
  "season": "Spring through fall depending on region, with peak fruiting May-September. Can flush multiple times per season. Most common in late spring and early summer. Young, tender specimens appear earlier in season.",
  "regions": [
    "Eastern North America",
    "Midwest",
    "Southern United States",
    "Great Lakes region",
    "Widespread east of Rocky Mountains",
    "Europe and Asia"
  ],
  "lookalikes": [
    "Laetiporus cincinnatus (white pore surface, grows from ground/roots)",
    "Laetiporus gilbertsonii (western, eucalyptus host)",
    "Jack-o'-lantern (Omphalotus) - toxic, has gills not pores, different growth",
    "Other Laetiporus species (all edible, different hosts/regions)"
  ],
  "safety_notes": "CHOICE EDIBLE when young and tender: Harvest only young, soft, pliable specimens with moist texture. Avoid old, dry, crumbly specimens. IMPORTANT: Some people experience digestive upset, especially from specimens growing on conifers, eucalyptus, or cedar - avoid these hosts. Start with small amounts to test tolerance. Cook thoroughly. Best when edges are still growing and bright colored. Excellent chicken-like texture when properly prepared.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1717527.jpg",
      "photographer": "Jeff  Guillemette",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-20",
      "file_size_bytes": 143724,
      "width": 480,
      "height": 640,
      "sha256": "96ecc15722b354ccdb58b90e11a997df2f8e07812f5581037ef20111ec94ac0e"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1711715.jpg",
      "photographer": "Crystal (Squirrelgirl)",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-03",
      "file_size_bytes": 75342,
      "width": 482,
      "height": 640,
      "sha256": "cced2e82c7075ceb4a44c2c7c8fea1b49ed2b614b53cc34dc6f1d1dc5dc4f3d4"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:18:57.487276"
}