{
  "mushroom_id": "hydumb",
  "scientific_name": "Hydnum umbilicatum",
  "common_name": "Depressed Hedgehog",
  "edibility": "E",
  "description": "Depressed Hedgehog has a small orange to orange-brown cap (2-7 cm) with a distinctive DEPRESSED or SUNKEN CENTER (umbilicate), creating a funnel or vase shape. The underside is covered with brittle, downward-pointing SPINES or TEETH instead of gills or pores - these spines are orange to pale orange, shorter than H. repandum. The stem is central, slender, smooth, orange to pale orange, often darker at the base. The flesh is pale orange, thin, brittle, with a mild to slightly bitter taste. Spore print is white. Smaller and more orange-toned than the common Sweet Tooth.",
  "habitat": "Mycorrhizal with both hardwoods and conifers. Found on the ground in mixed forests, mossy areas, under oak, beech, and conifers. Often grows scattered or in small groups. Prefers acidic soils and moss.",
  "season": "Summer through fall (August-November), with peak fruiting in fall.",
  "regions": [
    "Pacific Northwest",
    "Northeast",
    "Midwest",
    "Rocky Mountains",
    "Europe"
  ],
  "lookalikes": [
    "Hydnum repandum (Sweet Tooth) - larger, paler, lacks depressed center",
    "Hydnum rufescens (Terracotta Hedgehog) - similar but darker, more reddish-brown",
    "Cantharellus species - have ridges not true teeth/spines"
  ],
  "safety_notes": "EDIBLE: Mild flavor when cooked, though smaller and less substantial than H. repandum. May develop slight bitterness with age. The distinctive spines/teeth on underside and depressed center make identification straightforward. Clean thoroughly as spines trap debris. Collect young specimens for best quality.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1712933.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-09-27",
      "file_size_bytes": 43036,
      "width": 640,
      "height": 427,
      "sha256": "d9dbf6fe2a93a581c1dd721abc3dfa1ebc830de898b31a48e2f24a269c292488"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1710284.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-09-25",
      "file_size_bytes": 63406,
      "width": 640,
      "height": 427,
      "sha256": "15a7c86a7263e1e486d238eaf346c57ba1b3bd5b7f90013743d422d417c6cd87"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}