{
  "mushroom_id": "pleery",
  "scientific_name": "Pleurotus eryngii",
  "common_name": "Pleurotus eryngii",
  "edibility": "E",
  "description": "Distinctive mushroom with small tan to brown cap 1-4 inches wide and thick, white, meaty stem 2-6 inches tall. Unlike typical oyster mushrooms, the thick cylindrical stem is the prized portion. Cap has decurrent gills. Grows from roots of dead herbaceous plants, not wood. Unique among Pleurotus species in North America.",
  "habitat": "Saprobic on roots of dead and dying herbaceous plants, particularly thistles (Eryngium species), sea holly, and other umbellifers in desert and arid grassland regions. NOT found on wood like other Pleurotus species. Grows from buried roots in sandy or disturbed soils.",
  "season": "Fall through spring in arid regions, typically October-April. Fruits after winter and spring rains in desert and semi-arid environments. Can appear sporadically throughout cool season with adequate moisture.",
  "regions": [
    "Southwestern deserts",
    "Southern California",
    "Mediterranean-climate regions",
    "Arid and semi-arid grasslands",
    "Native to Mediterranean, established in North America"
  ],
  "lookalikes": [
    "Other Pleurotus species (all grow on wood, not roots)",
    "Pleurotus nebrodensis (similar but different range)",
    "Cultivated King Oyster (same species, widely sold in stores)",
    "Young parasol mushrooms (different gill attachment, spore color)"
  ],
  "safety_notes": "CHOICE EDIBLE: Highly prized for its thick, meaty stem with excellent texture and mild flavor. One of the most popular cultivated specialty mushrooms sold as 'King Oyster' or 'King Trumpet' mushrooms. Wild specimens are choice edibles when properly identified. The thick stem is the most desirable part. Cook thoroughly to develop best flavor and texture.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1452110.jpg",
      "photographer": "Alan Rockefeller",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2022-04-06",
      "file_size_bytes": 35740,
      "width": 640,
      "height": 447,
      "sha256": "a76c50852810d3c2a992f8ad40877ef012a925a1c9fd62260dff561521521378"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1452111.jpg",
      "photographer": "Alan Rockefeller",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2022-04-06",
      "file_size_bytes": 33090,
      "width": 640,
      "height": 466,
      "sha256": "81d27168cf26c777b1997fbad54c80acaed53c24e15b7bcd027be23aeb19eab3"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}