{
  "mushroom_id": "cancib",
  "scientific_name": "Cantharellus cibarius",
  "common_name": "Golden Chanterelle",
  "edibility": "E",
  "description": "The Golden Chanterelle has a golden-yellow to egg-yolk colored cap 2-12 cm wide with an irregular, wavy margin that becomes funnel-shaped with age. The underside features thick, blunt, forked ridges (NOT true gills) that run down the stem and are the same golden color as the cap. The stem is solid, 2-8 cm tall, tapering downward, and white to pale yellow. The flesh is firm, white to pale yellow, and emits a distinctive fruity apricot-like odor. Spore print is pale yellow to cream.",
  "habitat": "Mycorrhizal with various tree species including oak, beech, birch, pine, spruce, and fir. Found in both coniferous and mixed hardwood forests, typically on well-drained slopes or mossy areas. Often fruits in the same locations year after year.",
  "season": "Summer through fall (June-November in North America, July-December in Europe). Peak fruiting occurs after heavy summer or fall rains, with timing varying by latitude and elevation.",
  "regions": [
    "Northern and Central Europe",
    "Northeastern North America",
    "Great Lakes region",
    "Pacific Northwest",
    "Northern Asia"
  ],
  "lookalikes": [
    "Jack-O'-Lantern (Omphalotus olearius/illudens) - TOXIC, has true sharp-edged gills, grows on wood, glows in the dark",
    "False Chanterelle (Hygrophoropsis aurantiaca) - Not toxic but poor quality, has true thin gills, more orange color",
    "Other Cantharellus species - All edible, similar appearance and preparation"
  ],
  "safety_notes": "CHOICE EDIBLE: One of the most prized wild mushrooms with excellent flavor and firm texture. The key to safe identification is examining the underside - chanterelles have thick, blunt, forked ridges that are difficult to separate from the cap, while toxic Jack-O'-Lanterns have thin, sharp-edged true gills. Chanterelles grow from soil (mycorrhizal), never on wood. Some people experience mild digestive upset; try a small amount first. Excellent sautéed in butter with their natural peppery, fruity flavor.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1567856.jpg",
      "photographer": "Michael Kennedy",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-06-19",
      "file_size_bytes": 23654,
      "width": 640,
      "height": 361,
      "sha256": "811d0143a8e74dc7c8481b1e9b39aa6df2f4093c0aae15687a0ca478080e3902"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1567857.jpg",
      "photographer": "Michael Kennedy",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-06-19",
      "file_size_bytes": 15560,
      "width": 640,
      "height": 361,
      "sha256": "4f70a6f6b01279635a5685f9fc69eaab4fd42f22caa6f5543498006d662ba7e5"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T00:00:00.000000"
}