{
  "mushroom_id": "pleost",
  "scientific_name": "Pleurotus ostreatus",
  "common_name": "Oyster Mushroom",
  "edibility": "E",
  "description": "Fan to oyster-shaped caps 2-10 inches wide, typically gray-brown to tan when young, fading to white. Smooth, moist surface with decurrent white gills running down the short lateral or absent stem. Grows in dense overlapping shelves from dead or dying hardwood logs and stumps. White spore print.",
  "habitat": "Saprobic on dead and dying hardwood trees, logs, and stumps, especially beech, oak, maple, and aspen. Forms dense clustered shelves growing from wood. Occasionally parasitic on stressed living trees. Common on fallen logs in mixed hardwood forests.",
  "season": "Fall through spring in most regions, with peak fruiting in October-November. Can fruit year-round in mild coastal climates with adequate moisture. Often appears after heavy rains and cool temperatures.",
  "regions": [
    "Eastern North America",
    "Pacific Northwest",
    "Great Lakes region",
    "Appalachian Mountains",
    "Temperate regions worldwide"
  ],
  "lookalikes": [
    "Pleurotus pulmonarius (nearly identical, paler, summer fruiting)",
    "Angel wings (Pleurocybella porrigens) - toxic, smaller, pure white, on conifers",
    "Crepidotus species - brown spores, smaller, different texture",
    "Elm oyster (Hypsizygus ulmarius) - central stem, less pronounced oyster shape"
  ],
  "safety_notes": "CHOICE EDIBLE: One of the most popular cultivated mushrooms worldwide with excellent flavor and texture. Wild specimens are safe and delicious when properly identified. Cook thoroughly before eating as raw oyster mushrooms can cause digestive upset in some people. Avoid older specimens that may be tough or insect-infested. Widely cultivated commercially, making it familiar to most people.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1670345.jpg",
      "photographer": "Huafang",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-05-20",
      "file_size_bytes": 67850,
      "width": 640,
      "height": 482,
      "sha256": "4251e7d8ec1831c63cd96dc3e16d0730735f7b0eff7fb476e4b838cf3d599a1e"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1733337.jpg",
      "photographer": "Dave W",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-12-31",
      "file_size_bytes": 86858,
      "width": 640,
      "height": 507,
      "sha256": "440d644be0f31fba34ae26f88cf441151573f5b18ee03aeabbf3ef42375bfc37"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:35:46.261591"
}