{
  "mushroom_id": "lycper",
  "scientific_name": "Lycoperdon perlatum",
  "common_name": "Lycoperdon perlatum",
  "edibility": "E",
  "description": "Small pear-shaped puffballs 1-3 inches tall, 1-2 inches wide, with distinctive spiny or warty surface when young. White becoming tan to brown with age. Covered with small cone-shaped spines that fall off leaving net-like pattern. Interior pure white when edible, turning olive-yellow then brown. Has pronounced sterile base. Opens with single pore at top when mature.",
  "habitat": "Saprobic on ground in mixed hardwood and conifer forests, wood edges, mossy areas, and rotting wood. Often grows in troops or scattered groups. Common on forest floors with rich organic matter, on decaying stumps, and in moss-covered areas.",
  "season": "Summer through fall, typically July-October. Peak fruiting in August-September. Can appear into November in mild regions. Fruits after warm rains.",
  "regions": [
    "Eastern North America",
    "Pacific Northwest",
    "Rocky Mountains",
    "Great Lakes region",
    "Widespread across temperate North America",
    "Circumboreal distribution"
  ],
  "lookalikes": [
    "Other Lycoperdon species (most edible when white inside)",
    "DEADLY: Immature Amanita buttons (ALWAYS CUT OPEN - will show developing gills/cap inside)",
    "Scleroderma species/Earthballs (toxic, purple-black interior, thick warty skin)",
    "Lycoperdon pyriforme (smooth surface, grows on wood in tight clusters)"
  ],
  "safety_notes": "EDIBLE when pure white inside: CRITICAL - ALWAYS cut specimen completely in half from top to bottom before consuming. Edible ONLY if interior is completely pure white and firm throughout like marshmallow. If any yellow, olive, brown, or developing structures visible inside, DO NOT EAT. This prevents consuming toxic Scleroderma and immature deadly Amanitas. The spiny surface when young helps identification but must verify white interior. Cook thoroughly - good mild flavor.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1723310.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-05",
      "file_size_bytes": 40870,
      "width": 640,
      "height": 427,
      "sha256": "9bd78ffa68b85a9358b87ced4958d2bb98f4ca6f0d2a5d8f47f054e958c3f200"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1723311.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-05",
      "file_size_bytes": 48344,
      "width": 640,
      "height": 427,
      "sha256": "e1e4721679e9a34c106a965d67f391b1f9de88157371d5bf7ee579366346ce5b"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}