{
  "mushroom_id": "trimur",
  "scientific_name": "Tricholoma murrillianum",
  "common_name": "Southwestern Matsutake",
  "edibility": "E",
  "description": "Southwestern Matsutake has a robust white to cream cap (6-15 cm) that develops brownish tones with age. The cap is convex to flat, dry, smooth to slightly fibrillose. Gills are white to cream, attached, crowded. The stem is thick, white, firm, with a PARTIAL VEIL that leaves a COTTONY RING or fibrillose zone on the upper stem - often less prominent than T. magnivelare. The diagnostic feature is the SPICY, CINNAMON-LIKE ODOR, though sometimes less intense than the Pacific Northwest matsutake. Flesh is white, firm, dense. Spore print is white. Adapted to southwestern high elevation forests.",
  "habitat": "Mycorrhizal with CONIFERS in southwestern mountains, especially ponderosa pine, white fir, and Douglas fir. Forms obligate mycorrhizal relationships. Grows on the ground in duff or needle litter in high elevation conifer forests (typically 6,000-10,000 feet). Requires mature forests with specific mycorrhizal networks.",
  "season": "Late summer through fall (August-October) in southwestern mountains, fruiting after monsoon rains.",
  "regions": [
    "New Mexico",
    "Arizona",
    "Southern Colorado",
    "Southern Rocky Mountains",
    "Southwestern high mountains"
  ],
  "lookalikes": [
    "Tricholoma magnivelare - Pacific Northwest species, very similar",
    "Tricholoma matsutake - Asian species",
    "Amanita smithiana - TOXIC - has volva at base",
    "Other white Tricholoma species - lack cinnamon odor"
  ],
  "safety_notes": "CHOICE EDIBLE: Highly prized in the Southwest, commercially harvested. The CINNAMON/SPICY ODOR is key for identification, though sometimes subtler than northern matsutake. Best when young and firm. CRITICAL: Always check for absence of volva (cup at base) to rule out toxic Amanita species. The ring and cinnamon odor are diagnostic. Some foragers consider it slightly less aromatic than T. magnivelare but still excellent.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1725582.jpg",
      "photographer": "Ron Pastorino",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-11-04",
      "file_size_bytes": 128318,
      "width": 640,
      "height": 563,
      "sha256": "8c14cd406d0ca0a070dae5d0c8f599a5ab7b67bfb53aa9894c041ca397a82111"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1651537.jpg",
      "photographer": "",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-01-13",
      "file_size_bytes": 12316,
      "width": 482,
      "height": 640,
      "sha256": "63aec1140a6c93f42d8ef6433c91074146579fb2ce078755fbb6bcf824f9ab11"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T21:00:00.000000"
}