{
  "mushroom_id": "lycpyr",
  "scientific_name": "Lycoperdon pyriforme",
  "common_name": "Pear-shaped Puffball",
  "edibility": "E",
  "description": "Small pear-shaped puffballs 1-2 inches tall, 0.75-1.5 inches wide, with smooth to minutely granular surface, lacking spines. White to tan to brown with age. Grows in dense clusters connected by white mycelial strands (rhizomorphs). Interior pure white when edible, turning olive-yellow then brown. Distinguished by smooth surface and clustered growth on wood.",
  "habitat": "Saprobic directly on well-decayed wood including logs, stumps, buried wood, and woody debris. Grows in dense clusters of dozens of fruiting bodies connected at base. Common on rotting hardwood and conifer wood in forests. Often appears to grow from soil but always connected to buried wood.",
  "season": "Summer through fall, typically July-November. Can appear spring through fall in mild climates. Peak fruiting August-October. One of the latest-fruiting puffballs.",
  "regions": [
    "Eastern North America",
    "Pacific Northwest",
    "Rocky Mountains",
    "Great Lakes region",
    "Widespread across North America",
    "Cosmopolitan distribution worldwide"
  ],
  "lookalikes": [
    "Lycoperdon perlatum (spiny surface, not clustered on wood)",
    "DEADLY: Immature Amanita buttons (ALWAYS CUT OPEN - will show developing gills/cap inside)",
    "Other small Lycoperdon species (different habitat, not clustered on wood)",
    "Young Apioperdon (Lycoperdon) species (different surface texture)"
  ],
  "safety_notes": "EDIBLE when pure white inside: CRITICAL - ALWAYS cut specimen completely in half from top to bottom before consuming. Edible ONLY if interior is completely pure white and firm throughout. If any yellow, olive, brown, or developing structures visible inside, DO NOT EAT. This prevents consuming toxic lookalikes and immature deadly Amanitas. The clustered growth on wood and white mycelial strands help identification. Cook thoroughly - mild pleasant flavor when young.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1719866.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-21",
      "file_size_bytes": 45098,
      "width": 640,
      "height": 427,
      "sha256": "025b68dcca9112710f3959f8bb7d0f77f9d8cd19726479ecbe880eb39fe3fb8c"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1717930.jpg",
      "photographer": "Eva Skific",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-10-08",
      "file_size_bytes": 44818,
      "width": 640,
      "height": 427,
      "sha256": "69d292fb21699cee44f79057132cff9d0cf638d5adf550166783c068eb52dfe5"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}