{
  "mushroom_id": "plepop",
  "scientific_name": "Pleurotus populinus",
  "common_name": "Aspen Oyster",
  "edibility": "E",
  "description": "Fan to oyster-shaped caps 2-6 inches wide, white to cream or pale tan, sometimes with grayish tones. Smooth surface with decurrent white gills and short lateral or absent stem. Distinguished by its strong preference for aspen and cottonwood trees. Grows in dense overlapping clusters. White spore print.",
  "habitat": "Saprobic specifically on dead and dying aspen (Populus tremuloides), cottonwood (Populus species), and occasionally other poplar trees. Forms dense clustered shelves on logs, stumps, and standing dead trees. Strongly associated with Populus species in mountainous and northern regions.",
  "season": "Late spring through fall, with peak fruiting in May-October. Most common in early summer. Fruits after spring rains in aspen groves and riparian cottonwood areas.",
  "regions": [
    "Rocky Mountains",
    "Pacific Northwest",
    "Northern Plains",
    "Intermountain West",
    "Western North America",
    "Northern North America"
  ],
  "lookalikes": [
    "Pleurotus ostreatus (darker, wider range of hardwoods)",
    "Pleurotus pulmonarius (nearly identical but different host trees)",
    "Angel wings (Pleurocybella porrigens) - toxic, pure white, on conifers only",
    "Hypsizygus ulmarius (more central stem, on elm)"
  ],
  "safety_notes": "EDIBLE: Good edible mushroom with mild flavor, similar to cultivated oyster mushrooms. Cook thoroughly before eating. Safe when properly identified. The strong association with aspen and cottonwood trees is a helpful identification feature. Harvest young, fresh specimens for best quality.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1671361.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-05-26",
      "file_size_bytes": 92202,
      "width": 480,
      "height": 640,
      "sha256": "ab584c44a19e8be388c08b68b220b44f70bc572f672fa8c98da3dabd01292b21"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1671362.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-05-26",
      "file_size_bytes": 117926,
      "width": 480,
      "height": 640,
      "sha256": "22e8f7ab52e7e0940cd7a073638fcdbbe292e5e914ef1dc3e769d327b0c6e10e"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}