{
  "mushroom_id": "cancal",
  "scientific_name": "Cantharellus californicus",
  "common_name": "Cantharellus californicus",
  "edibility": "E",
  "description": "The California Chanterelle (also called Mud Puppy) has a white to pale cream cap 5-15 cm wide that often stains yellowish-brown or orange-brown, especially when handled or with age. The cap becomes deeply funnel-shaped with maturity and has wavy, irregular margins. The underside features thick, blunt, forked ridges (NOT true gills) that are white to cream, widely spaced, and run down the stem. The stem is solid, stout, 3-10 cm tall, white to cream, often quite robust. Flesh is white, very firm, with a mild to slightly peppery odor. Spore print is white to pale cream.",
  "habitat": "Mycorrhizal primarily with coast live oak (Quercus agrifolia), also associates with tanoak, madrone, and Douglas fir in mixed coastal forests. Found in oak woodlands, mixed evergreen forests, and the coastal fog belt of California. Prefers well-drained slopes and areas with deep leaf litter.",
  "season": "Winter rainy season (November-March), fruiting with the onset of winter rains in California. Peak season is typically December-February. Can continue fruiting into early spring if moisture persists. Unlike northern chanterelles, this is primarily a winter mushroom.",
  "regions": [
    "California Coast Ranges",
    "San Francisco Bay Area",
    "Northern California coastal forests",
    "Sierra Nevada western foothills",
    "Southern Oregon (rare)"
  ],
  "lookalikes": [
    "Cantharellus subalbidus - Edible, similar white color, found in Pacific Northwest with conifers, lacks brown staining",
    "False Chanterelle (Hygrophoropsis aurantiaca) - Not toxic but poor quality, has true thin gills, more orange color",
    "Hygrophorus species - Edible, has true gills that are more widely spaced, different texture"
  ],
  "safety_notes": "CHOICE EDIBLE: The California Chanterelle is highly prized and one of the most important commercial wild mushrooms in California. The thick, blunt ridges are the critical identification feature - they feel waxy and cannot be easily separated from the cap, unlike the sharp-edged true gills of lookalikes. The robust, firm texture makes it excellent for cooking; it holds up well to sautéing and has a mild, pleasant flavor. The brown staining when handled is normal. Some people may experience mild digestive upset - start with small portions.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1642142.jpg",
      "photographer": "Alan Rockefeller",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-12-31",
      "file_size_bytes": 24490,
      "width": 640,
      "height": 480,
      "sha256": "3c4d3c1a990e345847d4669b5966cdbb34a2d001e2085e4c714b20182fe14493"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1642143.jpg",
      "photographer": "Alan Rockefeller",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-12-31",
      "file_size_bytes": 107254,
      "width": 640,
      "height": 480,
      "sha256": "52dc637c1a89cd90b8a166176011a9685cad6b1a79e3bf11fc4383ba4aea79f6"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T00:00:00.000000"
}