{
  "mushroom_id": "agabit",
  "scientific_name": "Agaricus bitorquis",
  "common_name": "Agaricus bitorquis",
  "edibility": "E",
  "description": "The Pavement Mushroom or Spring Agaricus is a stocky robust species with a cap 5-15 cm across, initially rounded becoming convex. The cap is white to cream, smooth or with slight cracking, often staining yellowish-brown with age or bruising. The gills are free, initially pale pink becoming chocolate brown. The stem is 3-8 cm tall, very short and stout (distinctive), white, with a double ring (often appearing as two separate rings, hence 'bitorquis'). The flesh is firm, white, with a mild pleasant odor. Notably tough and resilient compared to other Agaricus.",
  "habitat": "Found in highly disturbed urban environments including sidewalk cracks, compacted soil along roads, parking lots, gravel paths, landscaped beds, and under asphalt. Remarkably tolerant of poor soil and human disturbance. Also in gardens and lawns with hard-packed soil. Fruits scattered to clustered, often pushing through hard surfaces.",
  "season": "Spring through fall (April-November) with peak in late spring and early summer. Can fruit year-round in mild climates like California. More cold-tolerant than most Agaricus species, often appearing in cool weather when others are absent.",
  "regions": [
    "Europe (native)",
    "North America (widespread, all regions)",
    "California (very common)",
    "Urban areas worldwide",
    "Temperate to subtropical climates",
    "Cosmopolitan in cities"
  ],
  "lookalikes": [
    "Agaricus campestris (edible) - more delicate, taller stem, grassland habitat",
    "Agaricus bisporus (cultivated mushroom, edible) - similar but cultivated, less robust",
    "Young Amanita species (some deadly) - have a volva at base, gills don't turn pink-brown",
    "Agaricus bernardii (edible) - coastal species, briny habitat, similar appearance"
  ],
  "safety_notes": "CHOICE EDIBLE: Excellent eating with firm dense texture that holds up well in cooking. Often more flavorful than store-bought button mushrooms. Cook thoroughly. Critical identification: verify very SHORT STOUT stem (distinctive feature), DOUBLE ring, FREE gills turning pink then chocolate brown, CHOCOLATE BROWN spore print, NO volva at base, urban/disturbed habitat. The stocky build and pavement habitat are distinctive. Wash well as specimens often grow in dirty urban environments. Highly resistant to bruising and insect damage.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1667634.jpg",
      "photographer": "Kevin Fox",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-04-03",
      "file_size_bytes": 30240,
      "width": 299,
      "height": 640,
      "sha256": "b8c0822eca069f9adac112fea1b3b5f29ede428a0e55ca49c9c310abc42faec6"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1667635.jpg",
      "photographer": "Kevin Fox",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-04-03",
      "file_size_bytes": 44562,
      "width": 640,
      "height": 351,
      "sha256": "a0618a54d140d180bee42b7373c27eb12cfb3ab5d05f36b110833f80a157b540"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T20:00:00.000000"
}