{
  "mushroom_id": "calsub",
  "scientific_name": "Calbovista subsculpta",
  "common_name": "Calbovista subsculpta",
  "edibility": "E",
  "description": "Medium to large round to oval puffballs 2-6 inches diameter with distinctive sculptured surface of low polygonal warts and plates giving geometric pattern. White to tan to brown with age. Interior pure white when edible, turning olive-yellow then brown. Small basal attachment but no prominent sterile base. Opens with irregular pore at top. Unique sculptured surface pattern.",
  "habitat": "Saprobic in mountainous coniferous forests, particularly under ponderosa pine, lodgepole pine, Douglas-fir, and spruce. Common in montane and subalpine forests. Prefers well-drained forest floors at higher elevations. Often in pine needle duff and forest clearings.",
  "season": "Summer through fall in mountains, typically July-October. Peak fruiting August-September after monsoon rains. Most common mid to late summer in montane forests.",
  "regions": [
    "Rocky Mountains",
    "Sierra Nevada",
    "Cascade Range",
    "Southwestern mountains",
    "Western montane conifer forests",
    "Colorado to British Columbia"
  ],
  "lookalikes": [
    "Calvatia booniana (similar scales but thicker, different pattern)",
    "DEADLY: Immature Amanita buttons (ALWAYS CUT OPEN - will show developing gills/cap inside)",
    "Scleroderma species/Earthballs (toxic, purple-black interior, thicker warty rind)",
    "Other sculptured Calvatia species (similar edibility when white)"
  ],
  "safety_notes": "EDIBLE when pure white inside: CRITICAL - ALWAYS cut specimen completely in half from top to bottom before consuming. Edible ONLY if interior is completely pure white and firm throughout. If any yellow, olive, brown, or developing structures visible inside, DO NOT EAT. This prevents consuming toxic lookalikes and immature deadly Amanitas. The distinctive geometric sculptured surface helps identification, but white interior is the definitive edibility test. Cook thoroughly.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1470448.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2022-06-17",
      "file_size_bytes": 110874,
      "width": 480,
      "height": 640,
      "sha256": "1db346ac95ce5e6845f24c7c5ce39095fc0dec0aca0834476c6e524233795a42"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1470449.jpg",
      "photographer": "Drew Henderson",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2022-06-17",
      "file_size_bytes": 95434,
      "width": 480,
      "height": 640,
      "sha256": "65d0b97a71a00df496da6cfe54db57beff034d142d0c6a477522849c340dccf3"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}