{
  "mushroom_id": "calcya",
  "scientific_name": "Calvatia cyathiformis",
  "common_name": "Calvatia cyathiformis",
  "edibility": "E",
  "description": "Medium to large puffballs 3-8 inches tall and 2-6 inches wide, shaped like inverted pear, top, or vase with prominent thick sterile base comprising lower half. White to grayish-brown exterior becoming purple-brown with age. Interior pure white when edible, maturing to purple-brown spore mass. Distinguished by cup-like sterile base that persists after spores disperse.",
  "habitat": "Saprobic in grasslands, pastures, meadows, lawns, fields, and open woods. Prefers disturbed areas with rich soil. Common in parks, golf courses, roadsides, and agricultural lands. Often grows in rings or scattered groups.",
  "season": "Late summer through fall, typically August-October. Peak fruiting in September after late summer rains. Can appear into November in mild climates.",
  "regions": [
    "Eastern North America",
    "Midwest and Great Plains",
    "Pacific coast",
    "Southern Canada",
    "Widespread across North America",
    "Cosmopolitan distribution"
  ],
  "lookalikes": [
    "Other Calvatia species with sterile base (similar edibility when white inside)",
    "DEADLY: Immature Amanita buttons (ALWAYS CUT OPEN - will show developing gills/cap inside)",
    "Scleroderma species/Earthballs (toxic, purple-black interior from start, no sterile base)",
    "Handkea (Calvatia) excipuliformis (nearly identical, same edibility)"
  ],
  "safety_notes": "EDIBLE when pure white inside: CRITICAL - ALWAYS cut specimen completely in half from top to bottom before consuming. Edible ONLY if interior is completely pure white and firm throughout. If any purple, yellow, brown, or developing structures visible inside, DO NOT EAT. The purple-brown mature spores are harmless but inedible. This cutting rule prevents consuming toxic lookalikes and immature deadly Amanitas. The persistent cup-shaped base is distinctive. Cook thoroughly when white.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1699011.jpg",
      "photographer": "Dave W",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-08-18",
      "file_size_bytes": 81978,
      "width": 640,
      "height": 480,
      "sha256": "08eb68f45de38ccaf4d9a4033e068336d755458b634870abe6fe2568f29cefde"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1699012.jpg",
      "photographer": "Dave W",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-08-18",
      "file_size_bytes": 79784,
      "width": 640,
      "height": 480,
      "sha256": "cec43de6f829e776db61ff6efc95aa3911da73444fbdc60655ed8c16da167bab"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}