{
  "mushroom_id": "trefuc",
  "scientific_name": "Tremella fuciformis",
  "common_name": "Snow Fungus",
  "edibility": "E",
  "description": "Snow Fungus is a white to pale yellow jelly fungus forming soft frilly masses resembling sea coral or snow. Fruitbodies 5-15 cm across when fresh, composed of thin, branched, translucent lobes with a delicate ruffled appearance. Color is pure white to pale cream or light yellow. Texture is soft, gelatinous, and trembling. The lobes are thin and petal-like, creating an intricate lacey structure. Becomes hard and shrunken when dry, reviving when moistened.",
  "habitat": "Found on dead branches and wood of broadleaf trees, typically high on standing dead trees or fallen logs. Often parasitic on other wood-decay fungi. In nature, found on hardwoods in forests. Widely cultivated commercially on hardwood sawdust substrate. Prefers warm humid environments.",
  "season": "In the wild, primarily summer through fall (June-November) in warm climates. In tropical and subtropical regions, may fruit year-round. Cultivated year-round commercially. Peak wild fruiting occurs during warm humid weather after rains.",
  "regions": [
    "Asia (native, widespread)",
    "Tropical and subtropical regions worldwide",
    "Southern United States (rare in wild)",
    "Cultivated commercially worldwide",
    "Natural in warm temperate to tropical forests"
  ],
  "lookalikes": [
    "Tremella mesenterica (edible) - bright yellow, more compact brain-like",
    "Tremella fuciformis cultivated strains - vary in color from white to cream",
    "Exidia species (edible) - darker, more compact, not frilly",
    "No toxic lookalikes"
  ],
  "safety_notes": "EDIBLE: Highly prized in Asian cuisine and traditional Chinese medicine. Mild sweet flavor and crunchy-gelatinous texture when prepared. Must be cooked - do not eat raw. Popular in sweet soups, desserts, and beverages. Believed to have health benefits including skin improvement and immune support. Almost always consumed as cultivated product rather than wild. Dried forms must be soaked to rehydrate. Safe with no toxic lookalikes. The white frilly appearance is distinctive. Expensive specialty ingredient in Asian markets.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1684389.jpg",
      "photographer": "Ryan",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-07-20",
      "file_size_bytes": 22236,
      "width": 640,
      "height": 480,
      "sha256": "e4dc59fd528c2bddd0ea121e6b9c3ad082895aa996fbf88c2890bf63affe3a4d"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1684390.jpg",
      "photographer": "Ryan",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-07-20",
      "file_size_bytes": 59496,
      "width": 640,
      "height": 480,
      "sha256": "bbb8fd49a0a994ba488f9c69af2375975d1f8daf9b8396d3db7977a1292cce1c"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-10T11:18:57.173269"
}