{
  "mushroom_id": "neolep",
  "scientific_name": "Neolentinus lepideus",
  "common_name": "Neolentinus lepideus",
  "edibility": "E",
  "description": "Medium to large mushroom with white to cream cap 2-6 inches wide covered in brown scales, especially concentrated toward center. White decurrent gills. Thick central white stem 2-5 inches tall with shaggy brown scales below partial ring. Has GILLS, not pores. Grows on conifer wood. Tough, fibrous texture. Strong anise or licorice smell when fresh.",
  "habitat": "Saprobic on conifer wood including logs, stumps, railroad ties, telephone poles, and construction lumber. Causes brown cubical rot. Common on pine, fir, spruce, and other conifer wood. Famous for damaging railroad ties and wooden structures - hence 'Train Wrecker.' Found on processed and weathered conifer wood.",
  "season": "Spring through fall, typically May-October. Can appear year-round on protected wood like railroad ties. Peak in summer. Fruits from same wood repeatedly over years.",
  "regions": [
    "Western North America",
    "Rocky Mountains",
    "Pacific Northwest",
    "Northern conifer forests",
    "Widespread in conifer regions",
    "Circumboreal distribution"
  ],
  "lookalikes": [
    "Lentinus tigrinus (similar but smaller, different wood, pattern)",
    "Scaly Pholiota species (brown spores, gills not decurrent)",
    "Other scaly wood mushrooms (different odors, spore colors)",
    "No dangerous lookalikes with this combination of features"
  ],
  "safety_notes": "EDIBLE when very young but not recommended: Only tender young buttons are soft enough to eat - specimens become very tough and fibrous quickly. Even young ones have tough texture requiring extensive cooking. Strong anise flavor is off-putting to many. Generally not worth eating due to toughness and strong flavor. Safe but unpalatable. The distinctive scales, anise odor, and conifer wood habitat aid identification.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1688175.jpg",
      "photographer": "Robert Russo",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-07-28",
      "file_size_bytes": 33134,
      "width": 640,
      "height": 480,
      "sha256": "0d59439c5cfa87d28e63a33fd801f1447fa4f31f6650877bc7bfdaf889fe0546"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1688176.jpg",
      "photographer": "Robert Russo",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-07-28",
      "file_size_bytes": 62860,
      "width": 480,
      "height": 640,
      "sha256": "fe6e8a1f10093c4ff50e8c12968ed53c32036e3eabfd84f5194e38aa5eff356c"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}