{
  "mushroom_id": "fishep",
  "scientific_name": "Fistulina hepatica",
  "common_name": "Fistulina hepatica",
  "edibility": "E",
  "description": "Distinctive tongue or bracket-shaped mushroom 3-10 inches wide resembling a slab of raw meat. Upper surface reddish-orange to liver-brown, rough and bumpy. UNIQUE: has individual tubes (not fused pores) that are cream colored, exuding red juice when cut. Flesh marbled red and white like meat, sour-acidic taste. Soft and moist texture. Unmistakable appearance.",
  "habitat": "Parasitic on living oak and chestnut trees, causing brown cubical heart rot (brown oak). Forms shelf brackets on trunks and large branches of mature oaks. Strongly associated with oak species in eastern forests. Can persist on same tree for years. Usually solitary or few brackets.",
  "season": "Late summer through fall, typically August-November. Peak fruiting in September-October. Can persist for several weeks. Most common in early fall on mature oaks.",
  "regions": [
    "Eastern North America",
    "Southeastern United States",
    "Great Lakes region",
    "Appalachian Mountains",
    "Midwest oak forests",
    "Europe and Asia"
  ],
  "lookalikes": [
    "Chicken of the Woods (Laetiporus) - bright colors, fused pores, no red juice",
    "Red-belted polypore (Fomitopsis) - tough, perennial, different texture",
    "No dangerous lookalikes - quite distinctive",
    "Resinous polypore - different color, no meat-like appearance"
  ],
  "safety_notes": "EDIBLE with caution: Strongly acidic/sour taste limits appeal - some people enjoy this tartness, others find it unpalatable. Young specimens are best. The acidity can cause digestive upset in sensitive individuals. Often pickled or used in small amounts for flavor. Can be blanched to reduce acidity. Cook thoroughly. Safe but an acquired taste. The meat-like texture and red juice are fascinating but flavor is very acidic.",
  "images": [
    {
      "index": 0,
      "source_url": "https://mushroomobserver.org/images/640/1718206.jpg",
      "photographer": "Penny Firth",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2024-09-20",
      "file_size_bytes": 143434,
      "width": 640,
      "height": 521,
      "sha256": "16bc5c63d3a1b2bef43f943930cade2fbc981e93d1d0aeeeab513d3ac5dfb233"
    },
    {
      "index": 1,
      "source_url": "https://mushroomobserver.org/images/640/1597578.jpg",
      "photographer": "Penny Firth",
      "license_url": "http://creativecommons.org/licenses/by-sa/3.0/",
      "observation_date": "2023-08-30",
      "file_size_bytes": 116232,
      "width": 640,
      "height": 490,
      "sha256": "9da59801ff1d3c914142d611d8f3740401903a1850b30cf3dca6b208d90222d3"
    }
  ],
  "content_version": "2.0",
  "last_updated": "2025-11-07T18:30:00.000000"
}